2018/python-decorator.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2018-08-05 周日 18:09 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Python 闭包和装饰器</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rgb-24bit">


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://rgb-24bit.github.io/blog/"> UP </a>
 |
 <a accesskey="H" href="https://rgb-24bit.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">Python 闭包和装饰器</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1d03ea3">1. 简介</a></li>
<li><a href="#org49f997c">2. 闭包</a></li>
<li><a href="#orga07669a">3. 装饰器</a>
<ul>
<li><a href="#org95d69ae">3.1. 多重装饰器</a></li>
</ul>
</li>
<li><a href="#org4852608">4. 参考链接</a></li>
</ul>
</div>
</div>

<div id="outline-container-org1d03ea3" class="outline-2">
<h2 id="org1d03ea3"><span class="section-number-2">1</span> 简介</h2>
<div class="outline-text-2" id="text-1">
<p>
<code>Python</code> 中， 适当的使用 <b>闭包</b> 和 <b>装饰器</b> 可以有效的提高编码效率， 同时
编写出更加简介的代码。
</p>

<p>
所以用这篇博客来总结对 <b>闭包</b> 和 <b>装饰器</b> 的理解。
</p>
</div>
</div>

<div id="outline-container-org49f997c" class="outline-2">
<h2 id="org49f997c"><span class="section-number-2">2</span> 闭包</h2>
<div class="outline-text-2" id="text-2">
<p>
<b>闭包</b> 的概念可以通过查阅 <a href="https://zh.wikipedia.org/wiki/%E9%97%AD%E5%8C%85_(%E8%AE%A1%E7%AE%97%E6%9C%BA%E7%A7%91%E5%AD%A6)">维基百科</a> 进行了解， 其中的一种说法感觉和 <code>Python</code> 中的
<b>闭包</b> 的实现更贴近：
</p>

<ul class="org-ul">
<li><b>闭包是由函数和与其相关的引用环境组合而成的实体</b>.</li>
</ul>

<p>
这种说法的理解可以通过代码来尝试理解：
</p>
<div class="org-src-container">
<pre class="src src-python">In [1]: <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">func</span>(num):
   ...:     <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">inner_func</span>():
   ...:         <span style="font-weight: bold;">return</span> num
   ...:     <span style="font-weight: bold;">return</span> inner_func
   ...:

In [2]: <span style="font-weight: bold; font-style: italic;">f</span> = func(10)

In [3]: f
Out[3]: &lt;function __main__.func.&lt;<span style="font-weight: bold;">locals</span>&gt;.inner_func&gt;
</pre>
</div>

<p>
这里实现了一个简单的 <b>闭包</b>, 调用函数 <code>func</code> 的时候会返回在 <code>func</code> 中定义的嵌套函数 <code>inner_func</code>.
</p>

<p>
在函数 <code>inner_func</code> 中使用变量 <code>num</code>, 这个变量来自函数 <code>func</code>.
</p>

<p>
可以看到第三行的输出
</p>
<pre class="example">
&lt;function __main__.func.&lt;locals&gt;.inner_func&gt;
</pre>

<p>
可以看到字段 <code>func.&lt;locals&gt;.inner_func</code>, 这说明 <code>inner_func</code> 是位于 <code>func</code> 的局部命名空间中的。
</p>

<p>
返回的 <code>inner_func</code> 除了函数体本身外， 还与 <code>func</code> 的局部命名空间存在联系。
</p>

<p>
现在换一个方式来进行测试：
</p>
<div class="org-src-container">
<pre class="src src-python">In [7]: <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">func</span>(lst=[]):
   ...:     <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">inner_func</span>():
   ...:         lst.append(10)
   ...:         <span style="font-weight: bold;">return</span> lst
   ...:     <span style="font-weight: bold;">return</span> inner_func
   ...:

In [8]: <span style="font-weight: bold; font-style: italic;">f1</span> = func()

In [9]: <span style="font-weight: bold; font-style: italic;">f2</span> = func()

In [10]: f1()
Out[10]: [10]

In [11]: f2()
Out[11]: [10, 10]

In [12]: <span style="font-weight: bold;">id</span>(f1) == <span style="font-weight: bold;">id</span>(f2)
Out[12]: <span style="font-weight: bold; text-decoration: underline;">False</span>
</pre>
</div>

<p>
<code>Python</code> 中， <b>函数</b> 也是一个 <b>引用类型</b> 的对象， 而 <b>引用类型</b> 的对象只会存在唯一的一个 <b>实体</b>.
</p>

<p>
因此函数 <code>func</code> 的 <b>局部命名空间</b> 也是唯一的。
</p>

<p>
而 <code>Out[12]</code> 可以看到， <code>f1</code> 和 <code>f2</code> 并不是同一个对象， 而分别调用 <code>f1</code> 和 <code>f2</code> 的输出却产生了影响。
</p>

<p>
说明 <code>f1</code> 和 <code>f2</code> 共用函数 <code>func</code> 的局部命名空间， 即： 函数 <code>f1</code> 和 <code>f2</code> 是和函数 <code>func</code> 的局部命名空间组合
而成的实体。
</p>

<p>
<b>总结:</b> <b>闭包</b> 函数是 <b>函数体</b> 和定义该 <b>函数体</b> 的 <b>局部命名空间</b> 共同组成的。 <b>闭包</b> 函数可以调用该 <b>局部命名空间</b> 的内容。
</p>

<p>
<b>PS:</b> 其实感觉如果像这样理解的话， 从模块中导入一个对象的方式也很像 <b>闭包</b>.
</p>
</div>
</div>

<div id="outline-container-orga07669a" class="outline-2">
<h2 id="orga07669a"><span class="section-number-2">3</span> 装饰器</h2>
<div class="outline-text-2" id="text-3">
<p>
可以说， <b>装饰器</b> 就是 <b>闭包</b> 的一种应用， 因为装饰器往往是将 <b>函数</b> 作为参数传入， 然后返回一个 <b>函数</b>, 这个函数和 <b>装饰器</b> 的
环境存在联系。
</p>

<p>
当然， <b>装饰器</b> 和 <b>被装饰</b> 的对象不一定必须是一个 <b>函数</b>. 只需要满足 <b>装饰器</b> 和 <b>被装饰</b> 的 <b>对象</b> 都是一个 <b>可调用</b> 的对象即可。
</p>

<p>
这也是 <code>Python</code> 中存在各种各样的 <b>装饰器</b> 的一个原因。
</p>

<p>
为了方便理解， 可以根据 <b>装饰器</b> 的使用方式将 <b>装饰器</b> 分为两类：
</p>
<ul class="org-ul">
<li>使用时 <b>不带参</b> 的装饰器</li>
<li>使用时 <b>带参</b> 的装饰器</li>
</ul>

<p>
<b>注意：</b> 是 <b>使用时</b> 不带参.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; text-decoration: underline;">@decorator</span>  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#19981;&#24102;&#21442;</span>
<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">func</span>():
    <span style="font-weight: bold;">pass</span>

<span style="font-weight: bold; text-decoration: underline;">@decorator</span>(level=3)  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#24102;&#21442;</span>
<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">func</span>():
    <span style="font-weight: bold;">pass</span>
</pre>
</div>

<p>
这两种类型的 <b>装饰器</b> 的调用流程存在一些区别：
</p>
<dl class="org-dl">
<dt>不带参的装饰器的调用流程</dt><dd><ol class="org-ol">
<li>将 <b>被装饰</b> 的 <b>对象</b> 作为 <b>参数</b> 传入 <b>装饰器</b></li>
<li><b>装饰器</b> 在 <b>执行</b> 完内部流程后返回一个 <b>可调用对象</b></li>
<li>这个 <b>可调用对象</b> 就是我们使用的 <b>被装饰</b> 的 <b>函数</b> 或其他对象</li>
</ol>

<p>
等价于： <code>func = decorator(func).</code>
</p></dd>

<dt>带参数的装饰器的调用流程</dt><dd><ol class="org-ol">
<li>将设置的 <b>参数</b> 传入 <b>装饰器</b></li>
<li><b>装饰器</b> 在 <b>执行</b> 完内部流程后返回一个 <b>可调用对象A</b></li>
<li>将 <b>被装饰</b> 的 <b>对象</b> 作为参数传入返回的这个 <b>可调用对象A</b></li>
<li><b>可调用对象A</b> 在 <b>执行</b> 完内部流程后返回一个 <b>可调用对象 B</b></li>
<li>这个 <b>可调用对象B</b> 就是我们使用的 <b>被装饰</b> 的 <b>函数</b> 或其他对象</li>
</ol></dd>
</dl>

<p>
可以看到， 两种 <b>装饰器</b> 的调用流程的区别很明显， <b>带参数</b> 比 <b>不带参数</b> 多了
一次调用流程。
</p>

<p>
并且每次调用流程都是 <b>执行</b> 了函数体内部的 <b>内容</b> 的。
</p>

<p>
这两种 <b>装饰器</b> 的区别主要是在 <b>调用流程</b> 上， 对于 <b>装饰器</b> 内部的代码并没做过多的
要求。
</p>

<p>
因此， 你可以写一个 <b>装饰器</b>, 这个 <b>装饰器</b> 接受 <b>带参</b> 与 <b>不带参</b> 两种调用方式：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">decorator</span>(func=<span style="font-weight: bold; text-decoration: underline;">None</span>, **kwargs):
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">wrap_arg</span>(func):
        <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">wrap</span>():
            func()
        <span style="font-weight: bold;">return</span> wrap

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">wrap</span>():
        func()

    <span style="font-weight: bold;">if</span> func <span style="font-weight: bold;">is</span> <span style="font-weight: bold; text-decoration: underline;">None</span>:
        <span style="font-weight: bold;">return</span> wrap_arg

    <span style="font-weight: bold;">return</span> wrap
</pre>
</div>

<p>
实现这样的 <b>装饰器</b> 的关键是 <b>关键字</b> 参数和 <b>第一个</b> 参数的设置。
</p>

<p>
如果 <b>不带参</b> 调用 <b>装饰器</b>, 那么被装饰的对象会作为 <b>装饰器</b> 的第一个参数传入。
</p>

<p>
如果 <b>带参</b> 调用 <b>装饰器</b>, 那么首先传入的 <b>参数</b> 会是你设置的参数， 而由于 <b>装饰器</b> 的
参数设置为了 <b>关键字</b> 参数， 因此 <b>第一个</b> 参数 <code>func</code> 会被置为 <code>None</code>.
</p>

<p>
此时根据相关的 <b>调用流程</b> 选择需要返回的 <b>对象</b> 即可。
</p>

<p>
当然， 上面的这个实现方式很不规范， 常用的实现方式是结合标准库 <code>functools</code> 来定义 <b>装饰器</b>.
</p>

<p>
比如使用 <code>functools.wraps</code> 来保留函数元信息， 使用 <code>functools.partial</code> 来创建可选参数的 <b>装饰器</b>.
</p>

<p>
这两个函数的使用可以浏览：
</p>
<ul class="org-ul">
<li><a href="http://python3-cookbook.readthedocs.io/zh_CN/latest/c09/p02_preserve_function_metadata_when_write_decorators.html">创建装饰器时保留函数元信息</a></li>
<li><a href="http://python3-cookbook.readthedocs.io/zh_CN/latest/c09/p06_define_decorator_that_takes_optional_argument.html">带可选参数的装饰器</a></li>
</ul>
</div>

<div id="outline-container-org95d69ae" class="outline-3">
<h3 id="org95d69ae"><span class="section-number-3">3.1</span> 多重装饰器</h3>
<div class="outline-text-3" id="text-3-1">
<p>
使用多个 <b>装饰器</b> 对一个对象进行装饰的时候， 靠近 <b>对象</b> 的装饰器优先调用。
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; text-decoration: underline;">@dec_a</span>
<span style="font-weight: bold; text-decoration: underline;">@dec_b</span>
<span style="font-weight: bold; text-decoration: underline;">@dec_c</span>
<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">func</span>():
    <span style="font-weight: bold;">pass</span>
</pre>
</div>

<p>
像上面的代码， 会首先调用装饰器 <code>dec_c</code>, 然后依次调用 <code>dec_b</code> 和 <code>dec_a</code>.
</p>

<p>
但是， 需要注意一下被装饰的函数在调用时执行的顺序：
</p>
<ul class="org-ul">
<li>装饰器的调用顺序为 <code>dec_c -&gt; dec_b -&gt; dec_a</code></li>
<li>那么装饰的层次就为 <code>dec_a -&gt; dec_b -&gt; dec_c</code>, 即： <code>dec_a(dec_b(dec_c(func)))</code>.</li>
<li>定义装饰器常用的方式是返回一个函数， 返回的函数体中除了执行 <code>func</code> 以外， 往往还有其他操作</li>
<li>因此， 调用 <code>func</code> 的时候， 会首先执行 <code>dec_a</code> 返回的函数体中的操作， 然后是 <code>dec_b</code>, <code>dec_c</code> 和 <code>func</code>.</li>
</ul>

<p>
所以， 在使用多重装饰器的时候需要分清楚 <b>装饰</b> 的顺序和 <b>调用</b> 的顺序。
</p>
</div>
</div>
</div>

<div id="outline-container-org4852608" class="outline-2">
<h2 id="org4852608"><span class="section-number-2">4</span> 参考链接</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="https://segmentfault.com/a/1190000004461404">Python 的闭包和装饰器</a></li>
<li><a href="https://zh.wikipedia.org/zh-hans/%E9%97%AD%E5%8C%85_(%E8%AE%A1%E7%AE%97%E6%9C%BA%E7%A7%91%E5%AD%A6)">维基百科 - 闭包</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
